backend/app/Models/HonorariosServicioModel.php

    public function getServiciosPorCategoria($categoriaId)
    {
        return $this->where('categoria_id', $categoriaId)
            ->where('activo', 1)
            ->orderBy('orden', 'ASC')
            ->orderBy('nombre', 'ASC')
            ->findAll();
---
SELECT *
FROM `honorarios_servicios`
WHERE `categoria_id` = '1'
AND `activo` = 1
ORDER BY `orden` ASC, `nombre` ASC