backend/app/Models/HonorariosConfiguracionModel.php

SELECT *
FROM `honorarios_configuracion`
WHERE `activo` = 1
ORDER BY `fecha_vigencia` DESC
 LIMIT 1
---
    public function getConfiguracionActiva()
    {
        return $this->where('activo', 1)
            ->orderBy('fecha_vigencia', 'DESC')
            ->first();