app/Models/HonorariosCategoriaModel.php

SELECT *
FROM `honorarios_categorias`
WHERE `activo` = 1
ORDER BY `orden` ASC, `nombre` ASC
---
    public function getCategoriasActivas()
    {
        return $this->where('activo', 1)
            ->orderBy('orden', 'ASC')
            ->orderBy('nombre', 'ASC')
            ->findAll();